# GetBoundaryCurveIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..GetBoundaryCurveIds Method
FabricArea Class See Also
---
Retrieves the identifiers of the set of curves forming the boundary of the Fabric Area.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<ElementId> GetBoundaryCurveIds()
```

Visual Basic
---
```text
Public Function GetBoundaryCurveIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetBoundaryCurveIds()
```

# ### Return Value
A collection of ElementIds of FabricAreaCurve elements.
# Remarks
Each ElementId in the collection is an Id of an Element of type CurveElem.
# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace